* >Natural Source Header 000000
* :Mode S
* :CP
* <Natural Source Header
DEFINE DATA LOCAL
1 VEHICLES VIEW OF VEHICLES
  2 MATRICULA
  2 MARCA
  2 MODELO
  2 COLOR
  2 ANIO
1 I-RESPUESTA (A1)
1 I-MATRICULA (A15) INIT <' '>/* Variable para la matrícula a buscar
END-DEFINE
CALLNAT "I-MATRI" I-MATRICULA
*
FIND VEHICLES WITH VEHICLES.MATRICULA = I-MATRICULA
*
  DISPLAY VEHICLES
*
END-FIND
*
END