* >Natural Source Header 000000
* :Mode S
* :CP
* <Natural Source Header
DEFINE DATA 
LOCAL USING CREARVEP
LOCAL
1 INPUT-ID (A8) INIT <' '> /* busqueda de PROPIETARIO-ID
END-DEFINE
* Subprograma con INPUT para la eleccion de PROPIETARIO-ID
CALLNAT "I-PROPIE" INPUT-ID
* Subprograma para STORE vehículo le pasa INPUT-ID para PROPIETARIO-ID
CALLNAT 'CREARVEH' INPUT-ID
*
END