* >Natural Source Header 000000
* :Mode S
* :CP
* <Natural Source Header

DEFINE DATA LOCAL
1 VEHICLES VIEW OF VEHICLES
  2 MATRICULA (A15)
  2 BASTIDOR (B4)
  2 PROPIETARIO-ID (A8) 
  2 GRUPO-DETALLE
    3 MARCA (A20)
    3 MODELO (A20)
    3 COLOR (A10)
  2 ANIO (N4.0)
*
END-DEFINE
*
WRITE *PROGRAM *DATE *USER
*
READ   VEHICLES
*
  WRITE PROPIETARIO-ID MATRICULA MARCA MODELO COLOR ANIO *COUNTER
*   
END-READ
*
END