DEFINE DATA LOCAL
/* >Natural Source Header 000000
/* :Mode S
/* :CP
/* <Natural Source Header
*****************************LEER EMPLEADO******************************
**
*
* Para conversion
1 PAJ-FECHA-A25        (A25) 
1 PAJ-FECHA-D          (D) 
1 PAJ-SALARY           (N9) 
*
1 SALARY-N9-A          (N9) (EM=*9)
1 SALARY-N9            (N9)
1 REDEFINE SALARY-N9
  2 SALARY-A9          (A9)
*
* Variables de control
1 PAJ-INPUT-ID         (A8) INIT <' '>
1 PAJ-ERR              (A66)
*
END-DEFINE
