DEFINE DATA LOCAL
/* >Natural Source Header 000000
/* :Mode S
/* :CP
/* <Natural Source Header
1 PAJ-INICIO-MENU 
  2 NOM-ARCH (A8) INIT <'INICIO'>
  2 OP1 (A23) INIT <'1. GESTIÓN DE EMPLEADOS'>
  2 OP1-NOM-ARCH (A8) INIT <'EM-MENU'>
  2 OP2 (A23) INIT <'2. GESTIÓN DE VEHICULOS'>
  2 OP2-NOM-ARCH (A8) INIT <'VE-MENU'>
END-DEFINE
