DEFINE DATA LOCAL
/* >Natural Source Header 000000
/* :Mode S
/* :CP
/* <Natural Source Header
*****************************LEER EMPLEADO******************************
**
*
* Para conversion
1 PAJ-FECHA-A25        (A25) 
1 PAJ-FECHA-D          (D) 
*
1 SALARY-A9          (A9)
*
* Variables de control
1 PAJ-INPUT-ID         (A8) INIT <' '>
1 PAJ-ERR              (A66)
*
END-DEFINE
