DEFINE DATA PARAMETER
/* >Natural Source Header 000000
/* :Mode S
/* :CP
/* <Natural Source Header
1 I-MATRICULA (A15) /* Variable para la matrícula a buscar
END-DEFINE
