DEFINE DATA PARAMETER
/* >Natural Source Header 000000
/* :Mode S
/* :CP
/* <Natural Source Header
*************************SELECCIONAR USUARIO****************************
1 PAJ-INPUT-ID (A8) 
END-DEFINE
